Tekla Open API Reference for Tekla Structures 2025
RebarStrand.StartPoint Property
 The start point of the single strand (the start point and end point define the length of the strand).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point StartPoint { get; set; }
Public Property StartPoint As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
RebarStrand Class
Tekla.Structures.Model Namespace